In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

# 8.1 分层索引

In [3]:
data = pd.Series(np.random.randn(9),
                index = [list('aaabbccdd'), [1,2,3,1,3,1,2,2,3]])

In [4]:
data

a  1   -1.265574
   2    0.611073
   3   -0.030313
b  1   -0.206689
   3    0.756164
c  1   -2.477346
   2    0.430284
d  2   -0.377470
   3    0.897358
dtype: float64

In [5]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [6]:
data['b']

1   -0.206689
3    0.756164
dtype: float64

In [7]:
data['b', 3]

0.7561642533775099

In [8]:
data['b':'c']

b  1   -0.206689
   3    0.756164
c  1   -2.477346
   2    0.430284
dtype: float64

In [9]:
data.loc['a',3]

-0.03031323300880079

In [10]:
data.loc[:, 2]

a    0.611073
c    0.430284
d   -0.377470
dtype: float64

In [11]:
data

a  1   -1.265574
   2    0.611073
   3   -0.030313
b  1   -0.206689
   3    0.756164
c  1   -2.477346
   2    0.430284
d  2   -0.377470
   3    0.897358
dtype: float64

In [12]:
data.loc[['b','d']]

b  1   -0.206689
   3    0.756164
d  2   -0.377470
   3    0.897358
dtype: float64

In [13]:
data

a  1   -1.265574
   2    0.611073
   3   -0.030313
b  1   -0.206689
   3    0.756164
c  1   -2.477346
   2    0.430284
d  2   -0.377470
   3    0.897358
dtype: float64

In [14]:
data.unstack()

          1         2         3
a -1.265574  0.611073 -0.030313
b -0.206689       NaN  0.756164
c -2.477346  0.430284       NaN
d       NaN -0.377470  0.897358

In [15]:
data.unstack().stack()

a  1   -1.265574
   2    0.611073
   3   -0.030313
b  1   -0.206689
   3    0.756164
c  1   -2.477346
   2    0.430284
d  2   -0.377470
   3    0.897358
dtype: float64

In [2]:
frame = pd.DataFrame(np.arange(12).reshape(4,3),
                    index = ['a a b b'.split(), [1,2,1,2]],
                    columns = ['ohio ohio colorado'.split(), 'green red green'.split()])

In [17]:
frame

     ohio     colorado
    green red    green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [18]:
frame['ohio']

     green  red
a 1      0    1
  2      3    4
b 1      6    7
  2      9   10

In [19]:
frame.loc['a', 'colorado']

   green
1      2
2      5

In [20]:
frame.loc['a'].loc[2, 'ohio']

green    3
red      4
Name: 2, dtype: int32

In [21]:
frame.loc['a']

   ohio     colorado
  green red    green
1     0   1        2
2     3   4        5

In [22]:
frame

     ohio     colorado
    green red    green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [23]:
frame.index

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [24]:
frame.columns

MultiIndex([(    'ohio', 'green'),
            (    'ohio',   'red'),
            ('colorado', 'green')],
           )

In [25]:
frame.index.name = ['key1', 'key2']

TypeError: MultiIndex.name must be a hashable type

In [ ]:
pd.__version__

In [ ]:
frame

In [ ]:
frame.index.name

In [ ]:
frame.columns.name='state'

In [ ]:
frame

In [ ]:
df = pd.DataFrame({'action_id' : [1,2,1,4,5],
               'name': ['jess', 'alex', 'jess', 'cath', 'mary'],
              'address': ['house', 'house', 'park', 'park', 'park'],
               'date': [ '01/01', '02/01', '03/01', '04/01', '05/01']})

In [ ]:
df

In [ ]:
frame

In [ ]:
frame.index.name = 'key1', 'key2',

In [ ]:
frame.index

In [ ]:
frame

In [ ]:
frame2 = pd.DataFrame(np.arange(6).reshape(3,2))

In [ ]:
frame2

In [ ]:
frame2.index.name = 'a'

In [ ]:
frame2

In [ ]:
frame

In [ ]:
frame.index.name

## 8.1.1 重排序和层级排序

In [ ]:
frame.swaplevel(0,1)

In [3]:
frame.swaplevel?

In [ ]:
frame

In [ ]:
frame.sort_index(level=1)

In [ ]:
frame.swaplevel(1,0).sort_index()

In [ ]:
frame

## 8.1.2 按层级进行汇总统计

In [ ]:
frame.sum()

In [ ]:
frame.sum(level=0)

In [ ]:
frame.sum(axis=1,)

In [ ]:
frame

In [ ]:
frame.sum(axis=1, level=0)

## 8.1.3 使用DataFrame 的列进行索引

In [13]:
frame = pd.DataFrame({
    'a': range(7),
    'b': range(7,0,-1),
    'c': 'one one one two two two two'.split(),
    'd': [0,1,2,0,1,2,3]
})

In [14]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [15]:
frame.set_index(['c','d'])

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [16]:
frame.set_index('c')

     a  b  d
c
one  0  7  0
one  1  6  1
one  2  5  2
two  3  4  0
two  4  3  1
two  5  2  2
two  6  1  3

In [17]:
frame2 = frame.set_index(['c', 'd'])

In [18]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [20]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [ ]:
data

In [ ]:
frame = pd.DataFrame(np.arange(12).reshape(4,3),
                    index = ['a a b b'.split(), [1,2,1,2]],
                    columns = 'green red green'.split())

In [ ]:
frame

In [21]:
frame.reset_index?

# 8.2 联合与合并数据集

## 8.2.1 数据库风格的DataFrame 连接

In [ ]:
df1 = pd.DataFrame({
    'key': list('bbacaab'),
    'data1': range(7)
})

In [ ]:
df2 = pd.DataFrame({
    'key':['a','b','d'],
    'data2': range(3)
})

In [ ]:
df1
df2

In [ ]:
pd.merge(df1, df2)

In [ ]:
pd.merge?

In [ ]:
pd.merge(df1, df2, on='key')

In [ ]:
df3 = pd.DataFrame({
    'lkey': list('bbacaab'),
    'data1': range(7)
})

In [ ]:
df4 = pd.DataFrame({
    'rkey': list('abd'),
    'data2': range(3)
})

In [ ]:
df3
df4

In [ ]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

In [ ]:
pd.merge(df1, df2, how='outer')

In [ ]:
df1
df2

In [ ]:
pd.merge(df1, df2)

In [ ]:
df1

In [ ]:
df2

In [ ]:
df1 = pd.DataFrame({
    'key': list('bbacab'),
    'data1': range(6)
})

In [ ]:
df2 = pd.DataFrame({
    'key': list('ababd'),
    'data2': range(5)
})

In [ ]:
df1
df2

In [ ]:
pd.merge(df1, df2, on='key', how='left')

In [ ]:
# 多对多是笛卡尔积

In [ ]:
pd.merge(df1, df2, how='inner')

In [ ]:
left = pd.DataFrame({
    'key1': 'foo foo bar'.split(),
    'key2': 'one two one'.split(),
    'lval': [1,2,3]
})

In [ ]:
left

In [ ]:
right = pd.DataFrame({
    'key1': 'foo foo bar bar'.split(),
    'key2': 'one one one two'.split(),
    'rval': [4,5,6,7]
})

In [ ]:
right

In [ ]:
pd.merge(left, right, on=['key1', 'key2'])

In [ ]:
pd.merge(left, right, on=['key1', 'key2'], how='outer')

In [ ]:
left

In [ ]:
right

In [ ]:
pd.merge(left, right, on='key1')

In [ ]:
pd.merge(left, right, on='key1', suffixes=('_left', '_right'))

## 8.2.2 根据索引合并

In [ ]:
left1 = pd.DataFrame({
    'key': list('abaabc'),
    'value': range(6)
})

In [ ]:
left1

In [ ]:
right1 = pd.DataFrame(
    {'group_val': [3.5, 7]}, index=['a', 'b']
)

In [ ]:
right1

In [ ]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

In [ ]:
lefth = pd.DataFrame({
    'key1': 'ohio ohio ohio nevada nevada'.split(),
    'key2': [2000, 2001, 2002, 2001, 2002],
    'data': np.arange(5.)
})

In [ ]:
lefth

In [ ]:
righth = pd.DataFrame(np.arange(12).reshape(6,2),
                     index = ['nevada nevada ohio ohio ohio ohio'.split(), [2001, 2000, 2000, 2000, 2001, 2002]],
                     columns = ['event1','event2'])

In [ ]:
righth

In [ ]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True)

In [ ]:
left2 = pd.DataFrame([[1,2], [3,4], [5,6]],
                    index = ['a', 'c', 'e'],
                    columns = ['ohio', 'nevada']
                    )

In [ ]:
left2

In [ ]:
right2 = pd.DataFrame([[7,8], [9,10], [11,12], [13,14]],
                     index = list('bcde'),
                     columns = ['missouri', 'alabama']
                     )

In [ ]:
right2

In [ ]:
pd.merge(left2, right2, left_index=True, right_index=True, how='outer')

In [ ]:
left2

In [ ]:
left2.join(right2)

In [ ]:
right2

In [ ]:
left2.join(right2, how='outer')

In [ ]:
left1

In [ ]:
left2

In [ ]:
left1.join(left2, on='key')

In [ ]:
left2.join(right2, how='outer')

In [ ]:
another = pd.DataFrame([[7,8], [9,10], [11,12], [16,17]],
                      index=['a','c','e','f'],
                      columns=['new york', 'oregon'])

In [ ]:
another

In [ ]:
left2.join([right2, another])

In [ ]:
left2.join([right2, another], how='outer').sort_index()

## 8.2.3 沿轴向连接

In [26]:
arr = np.arange(12).reshape(3,4)

In [27]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [28]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [29]:
s1 = pd.Series([0,1], index=['a','b'])
s2 = pd.Series([2,3,4], index=['c','d','e'])
s3 = pd.Series([5,6], index=['f','g'])

In [30]:
s1
s2
s3

a    0
b    1
dtype: int64

c    2
d    3
e    4
dtype: int64

f    5
g    6
dtype: int64

In [ ]:
pd.concat([s1,s2,s3])

In [ ]:
pd.concat([s1,s2,s3], axis=1)

In [ ]:
s4 = pd.concat([s1,s3])

In [ ]:
s4

In [ ]:
pd.concat([s1,s4],axis=1)

In [ ]:
pd.concat([s1,s4], axis=1, join='inner')

In [ ]:
pd.concat?

In [ ]:
pd.concat([s1,s4], axis=1, join_axes=[['a','c','b','e']])

In [ ]:
pd.concat([s1,s1,s3], keys=['one', 'two', 'three'])

In [ ]:
result = pd.concat([s1,s1,s3], keys=['one', 'two', 'three'])

In [ ]:
result.unstack()

In [33]:
pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three'])

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [34]:
df1 = pd.DataFrame(np.arange(6).reshape(3,2),
                  index=['a','b','c'],
                  columns=['one','two'])

In [35]:
df2 = pd.DataFrame(5+np.arange(4).reshape(2,2),
                  index=['a','c'],
                  columns=['three','four'])

In [36]:
df1
df2

   one  two
a    0    1
b    2    3
c    4    5

   three  four
a      5     6
c      7     8

In [37]:
pd.concat([df1, df2], axis=1, )

   one  two  three  four
a    0    1    5.0   6.0
b    2    3    NaN   NaN
c    4    5    7.0   8.0

In [38]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [41]:
pd.concat({'level1': df1, 'level2': df2}, axis=1)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [42]:
pd.concat({'level1': df1, 'level2': df2}, axis=1, names=['upper', 'lower'])

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [43]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [44]:
df2

   three  four
a      5     6
c      7     8

In [45]:
df1 = pd.DataFrame(np.random.randn(3,4), columns=list('abcd'))

In [46]:
df2 = pd.DataFrame(np.random.randn(2,3), columns=list('bda'))

In [47]:
df1

          a         b         c         d
0 -1.356901  1.668792  0.510379  1.749545
1 -1.258145  0.555605 -1.043008  0.123212
2  0.799837 -0.345527  0.521228 -0.002803

In [48]:
df2

          b         d         a
0 -0.963016 -0.120329 -0.121922
1  0.767036 -0.532439 -0.485383

In [49]:
pd.concat([df1, df2])

          a         b         c         d
0 -1.356901  1.668792  0.510379  1.749545
1 -1.258145  0.555605 -1.043008  0.123212
2  0.799837 -0.345527  0.521228 -0.002803
0 -0.121922 -0.963016       NaN -0.120329
1 -0.485383  0.767036       NaN -0.532439

In [50]:
pd.concat([df1, df2], ignore_index=True)

          a         b         c         d
0 -1.356901  1.668792  0.510379  1.749545
1 -1.258145  0.555605 -1.043008  0.123212
2  0.799837 -0.345527  0.521228 -0.002803
3 -0.121922 -0.963016       NaN -0.120329
4 -0.485383  0.767036       NaN -0.532439

In [51]:
pd.concat?

## 8.2.4 联合重叠数据

In [2]:
a = pd.Series([np.nan, 2.5, 0.0, 3.5, 4.5, np.nan],
             index = list('fedcba'))

In [3]:
b = pd.Series([0, np.nan, 2, np.nan, np.nan, 5.],
             index = list('abcdef'))

In [4]:
a
b

f    NaN
e    2.5
d    0.0
c    3.5
b    4.5
a    NaN
dtype: float64

a    0.0
b    NaN
c    2.0
d    NaN
e    NaN
f    5.0
dtype: float64

In [5]:
np.where(pd.isnull(a), b, a)

array([0. , 2.5, 0. , 3.5, 4.5, 5. ])

In [6]:
b.combine_first(a)

a    0.0
b    4.5
c    2.0
d    0.0
e    2.5
f    5.0
dtype: float64

In [7]:
df1 = pd.DataFrame({
    'a': [1,np.nan,5,np.nan],
    'b': [np.nan,2,np.nan,6],
    'c': range(2,18,4)
})

In [8]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [9]:
df2 = pd.DataFrame({
    'a': [5,4,np.nan,3,7],
    'b': [np.nan,3,4,6,8]
})

In [10]:
df1
df2

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [11]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

# 8.3 重塑和旋转

## 8.3.1 使用多层索引进行重塑

In [2]:
data = pd.DataFrame(np.arange(6).reshape(2,3),
                    index=pd.Index(['ohio', 'colorado'], name='state'),
                    columns=pd.Index(['one','two','three'], name='number')
                   )

In [3]:
data

number    one  two  three
state
ohio        0    1      2
colorado    3    4      5

In [4]:
result = data.stack()

In [5]:
result

state     number
ohio      one       0
          two       1
          three     2
colorado  one       3
          two       4
          three     5
dtype: int32

In [6]:
result.unstack(0)

state   ohio  colorado
number
one        0         3
two        1         4
three      2         5

In [7]:
result.unstack('state')

state   ohio  colorado
number
one        0         3
two        1         4
three      2         5

In [8]:
s1 = pd.Series([0,1,2,3], index=['a','b','c','d'])

In [9]:
s2 = pd.Series([4,5,6], index=['c','d','e'])

In [10]:
s1
s2

a    0
b    1
c    2
d    3
dtype: int64

c    4
d    5
e    6
dtype: int64

In [11]:
data2 = pd.concat([s1,s2], keys=['one', 'two'])

In [12]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [13]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [14]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [16]:
df = pd.DataFrame({
    'left': result, 'right': result+5
}, columns = pd.Index(['left', 'right'], name='side'))

In [17]:
result

state     number
ohio      one       0
          two       1
          three     2
colorado  one       3
          two       4
          three     5
dtype: int32

In [18]:
df

side             left  right
state    number
ohio     one        0      5
         two        1      6
         three      2      7
colorado one        3      8
         two        4      9
         three      5     10

In [19]:
df.unstack()

side     left           right
number    one two three   one two three
state
ohio        0   1     2     5   6     7
colorado    3   4     5     8   9    10

In [20]:
df.unstack('state')

side   left          right
state  ohio colorado  ohio colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [21]:
df.unstack('state').stack('side')

state         colorado  ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

## 8.3.2 将‘长’转换为‘宽’

In [3]:
data = pd.read_csv('examples/macrodata.csv')

In [4]:
data.head()

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
2,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
3,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
4,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19

In [24]:
periods = pd.PeriodIndex?

In [25]:
periods = pd.PeriodIndex(year=data.year, quarter=data.quarter, name='date')

In [26]:
periods

PeriodIndex(['1959Q1', '1959Q2', '1959Q3', '1959Q4', '1960Q1', '1960Q2',
             '1960Q3', '1960Q4', '1961Q1', '1961Q2',
             ...
             '2007Q2', '2007Q3', '2007Q4', '2008Q1', '2008Q2', '2008Q3',
             '2008Q4', '2009Q1', '2009Q2', '2009Q3'],
            dtype='period[Q-DEC]', name='date', length=203, freq='Q-DEC')

In [27]:
columns = pd.Index(['realgdp', 'infl', 'unemp'], name='item')

In [5]:
data = data.reindex?

In [ ]:
data = data.reindex

In [ ]:
data = data.reindex

In [30]:
data = data.reindex(columns = columns)

In [31]:
data

item    realgdp  infl  unemp
0      2710.349  0.00    5.8
1      2778.801  2.34    5.1
2      2775.488  2.74    5.3
3      2785.204  0.27    5.6
4      2847.699  2.31    5.2
..          ...   ...    ...
198   13324.600 -3.16    6.0
199   13141.920 -8.79    6.9
200   12925.410  0.94    8.1
201   12901.504  3.37    9.2
202   12990.341  3.56    9.6

[203 rows x 3 columns]

In [32]:
data.index

RangeIndex(start=0, stop=203, step=1)

In [34]:
data.index = periods.to_timestamp?

In [51]:
data.index = periods.to_timestamp('D', 'end')

In [52]:
periods

PeriodIndex(['1959Q1', '1959Q2', '1959Q3', '1959Q4', '1960Q1', '1960Q2',
             '1960Q3', '1960Q4', '1961Q1', '1961Q2',
             ...
             '2007Q2', '2007Q3', '2007Q4', '2008Q1', '2008Q2', '2008Q3',
             '2008Q4', '2009Q1', '2009Q2', '2009Q3'],
            dtype='period[Q-DEC]', name='date', length=203, freq='Q-DEC')

In [53]:
data.index

DatetimeIndex(['1959-03-31 23:59:59.999999999',
               '1959-06-30 23:59:59.999999999',
               '1959-09-30 23:59:59.999999999',
               '1959-12-31 23:59:59.999999999',
               '1960-03-31 23:59:59.999999999',
               '1960-06-30 23:59:59.999999999',
               '1960-09-30 23:59:59.999999999',
               '1960-12-31 23:59:59.999999999',
               '1961-03-31 23:59:59.999999999',
               '1961-06-30 23:59:59.999999999',
               ...
               '2007-06-30 23:59:59.999999999',
               '2007-09-30 23:59:59.999999999',
               '2007-12-31 23:59:59.999999999',
               '2008-03-31 23:59:59.999999999',
               '2008-06-30 23:59:59.999999999',
               '2008-09-30 23:59:59.999999999',
               '2008-12-31 23:59:59.999999999',
               '2009-03-31 23:59:59.999999999',
               '2009-06-30 23:59:59.999999999',
               '2009-09-30 23:59:59.999999999'],
              dtype='datetime64[ns]', name='date', length=203, freq=None)

In [54]:
data

item                             realgdp  infl  unemp
date
1959-03-31 23:59:59.999999999   2710.349  0.00    5.8
1959-06-30 23:59:59.999999999   2778.801  2.34    5.1
1959-09-30 23:59:59.999999999   2775.488  2.74    5.3
1959-12-31 23:59:59.999999999   2785.204  0.27    5.6
1960-03-31 23:59:59.999999999   2847.699  2.31    5.2
...                                  ...   ...    ...
2008-09-30 23:59:59.999999999  13324.600 -3.16    6.0
2008-12-31 23:59:59.999999999  13141.920 -8.79    6.9
2009-03-31 23:59:59.999999999  12925.410  0.94    8.1
2009-06-30 23:59:59.999999999  12901.504  3.37    9.2
2009-09-30 23:59:59.999999999  12990.341  3.56    9.6

[203 rows x 3 columns]

In [55]:
ldata = data.reset_index()

In [58]:
ldata

item                          date    realgdp  infl  unemp
0    1959-03-31 23:59:59.999999999   2710.349  0.00    5.8
1    1959-06-30 23:59:59.999999999   2778.801  2.34    5.1
2    1959-09-30 23:59:59.999999999   2775.488  2.74    5.3
3    1959-12-31 23:59:59.999999999   2785.204  0.27    5.6
4    1960-03-31 23:59:59.999999999   2847.699  2.31    5.2
..                             ...        ...   ...    ...
198  2008-09-30 23:59:59.999999999  13324.600 -3.16    6.0
199  2008-12-31 23:59:59.999999999  13141.920 -8.79    6.9
200  2009-03-31 23:59:59.999999999  12925.410  0.94    8.1
201  2009-06-30 23:59:59.999999999  12901.504  3.37    9.2
202  2009-09-30 23:59:59.999999999  12990.341  3.56    9.6

[203 rows x 4 columns]

In [72]:
data

item                             realgdp  infl  unemp
date
1959-03-31 23:59:59.999999999   2710.349  0.00    5.8
1959-06-30 23:59:59.999999999   2778.801  2.34    5.1
1959-09-30 23:59:59.999999999   2775.488  2.74    5.3
1959-12-31 23:59:59.999999999   2785.204  0.27    5.6
1960-03-31 23:59:59.999999999   2847.699  2.31    5.2
...                                  ...   ...    ...
2008-09-30 23:59:59.999999999  13324.600 -3.16    6.0
2008-12-31 23:59:59.999999999  13141.920 -8.79    6.9
2009-03-31 23:59:59.999999999  12925.410  0.94    8.1
2009-06-30 23:59:59.999999999  12901.504  3.37    9.2
2009-09-30 23:59:59.999999999  12990.341  3.56    9.6

[203 rows x 3 columns]

In [73]:
ldata = data.stack()

In [74]:
ldata

date                           item
1959-03-31 23:59:59.999999999  realgdp     2710.349
                               infl           0.000
                               unemp          5.800
1959-06-30 23:59:59.999999999  realgdp     2778.801
                               infl           2.340
                                            ...
2009-06-30 23:59:59.999999999  infl           3.370
                               unemp          9.200
2009-09-30 23:59:59.999999999  realgdp    12990.341
                               infl           3.560
                               unemp          9.600
Length: 609, dtype: float64

In [75]:
ldata = ldata.reset_index()

In [64]:
ldata.rename?

In [77]:
ldata = ldata.rename(columns = {0:'value'})

In [78]:
ldata

                             date     item      value
0   1959-03-31 23:59:59.999999999  realgdp   2710.349
1   1959-03-31 23:59:59.999999999     infl      0.000
2   1959-03-31 23:59:59.999999999    unemp      5.800
3   1959-06-30 23:59:59.999999999  realgdp   2778.801
4   1959-06-30 23:59:59.999999999     infl      2.340
..                            ...      ...        ...
604 2009-06-30 23:59:59.999999999     infl      3.370
605 2009-06-30 23:59:59.999999999    unemp      9.200
606 2009-09-30 23:59:59.999999999  realgdp  12990.341
607 2009-09-30 23:59:59.999999999     infl      3.560
608 2009-09-30 23:59:59.999999999    unemp      9.600

[609 rows x 3 columns]

In [79]:
pivoted = ldata.pivot('date', 'item', 'value')

In [80]:
pivoted

item                           infl    realgdp  unemp
date
1959-03-31 23:59:59.999999999  0.00   2710.349    5.8
1959-06-30 23:59:59.999999999  2.34   2778.801    5.1
1959-09-30 23:59:59.999999999  2.74   2775.488    5.3
1959-12-31 23:59:59.999999999  0.27   2785.204    5.6
1960-03-31 23:59:59.999999999  2.31   2847.699    5.2
...                             ...        ...    ...
2008-09-30 23:59:59.999999999 -3.16  13324.600    6.0
2008-12-31 23:59:59.999999999 -8.79  13141.920    6.9
2009-03-31 23:59:59.999999999  0.94  12925.410    8.1
2009-06-30 23:59:59.999999999  3.37  12901.504    9.2
2009-09-30 23:59:59.999999999  3.56  12990.341    9.6

[203 rows x 3 columns]

In [81]:
ldata['value2'] = np.random.randn(len(ldata))

In [82]:
ldata

                             date     item      value    value2
0   1959-03-31 23:59:59.999999999  realgdp   2710.349 -0.639145
1   1959-03-31 23:59:59.999999999     infl      0.000 -0.718377
2   1959-03-31 23:59:59.999999999    unemp      5.800 -0.445394
3   1959-06-30 23:59:59.999999999  realgdp   2778.801 -1.615712
4   1959-06-30 23:59:59.999999999     infl      2.340  0.278895
..                            ...      ...        ...       ...
604 2009-06-30 23:59:59.999999999     infl      3.370  0.553379
605 2009-06-30 23:59:59.999999999    unemp      9.200  0.975424
606 2009-09-30 23:59:59.999999999  realgdp  12990.341  0.830822
607 2009-09-30 23:59:59.999999999     infl      3.560 -1.419438
608 2009-09-30 23:59:59.999999999    unemp      9.600  1.523649

[609 rows x 4 columns]

In [83]:
pivoted = ldata.pivot('date', 'item')

In [88]:
pivoted

item                               infl   realgdp     unemp
date
1959-03-31 23:59:59.999999999 -0.718377 -0.639145 -0.445394
1959-06-30 23:59:59.999999999  0.278895 -1.615712  0.408724
1959-09-30 23:59:59.999999999 -0.576115 -0.179935 -1.331987
1959-12-31 23:59:59.999999999 -1.158728 -2.173436 -0.830074
1960-03-31 23:59:59.999999999 -2.052705  1.446627 -0.362657
...                                 ...       ...       ...
2008-09-30 23:59:59.999999999  0.591655  0.572518  0.120757
2008-12-31 23:59:59.999999999 -0.996535 -0.270136 -0.507626
2009-03-31 23:59:59.999999999  0.373330 -0.718912 -0.153116
2009-06-30 23:59:59.999999999  0.553379  0.364197  0.975424
2009-09-30 23:59:59.999999999 -1.419438  0.830822  1.523649

[203 rows x 3 columns]

In [87]:
pivoted = ldata.pivot('date', 'item', 'value2')

In [89]:
ldata

                             date     item      value    value2
0   1959-03-31 23:59:59.999999999  realgdp   2710.349 -0.639145
1   1959-03-31 23:59:59.999999999     infl      0.000 -0.718377
2   1959-03-31 23:59:59.999999999    unemp      5.800 -0.445394
3   1959-06-30 23:59:59.999999999  realgdp   2778.801 -1.615712
4   1959-06-30 23:59:59.999999999     infl      2.340  0.278895
..                            ...      ...        ...       ...
604 2009-06-30 23:59:59.999999999     infl      3.370  0.553379
605 2009-06-30 23:59:59.999999999    unemp      9.200  0.975424
606 2009-09-30 23:59:59.999999999  realgdp  12990.341  0.830822
607 2009-09-30 23:59:59.999999999     infl      3.560 -1.419438
608 2009-09-30 23:59:59.999999999    unemp      9.600  1.523649

[609 rows x 4 columns]

In [91]:
unstacked = ldata.set_index(['date', 'item'])

In [90]:
unstacked = ldata.set_index?

In [93]:
unstacked.unstack()

                              value                     value2            \
item                           infl    realgdp unemp      infl   realgdp
date
1959-03-31 23:59:59.999999999  0.00   2710.349   5.8 -0.718377 -0.639145
1959-06-30 23:59:59.999999999  2.34   2778.801   5.1  0.278895 -1.615712
1959-09-30 23:59:59.999999999  2.74   2775.488   5.3 -0.576115 -0.179935
1959-12-31 23:59:59.999999999  0.27   2785.204   5.6 -1.158728 -2.173436
1960-03-31 23:59:59.999999999  2.31   2847.699   5.2 -2.052705  1.446627
...                             ...        ...   ...       ...       ...
2008-09-30 23:59:59.999999999 -3.16  13324.600   6.0  0.591655  0.572518
2008-12-31 23:59:59.999999999 -8.79  13141.920   6.9 -0.996535 -0.270136
2009-03-31 23:59:59.999999999  0.94  12925.410   8.1  0.373330 -0.718912
2009-06-30 23:59:59.999999999  3.37  12901.504   9.2  0.553379  0.364197
2009-09-30 23:59:59.999999999  3.56  12990.341   9.6 -1.419438  0.830822


item                              unemp
date
1959-03-31 23:59:59.999999999 -0.445394
1959-06-30 23:59:59.999999999  0.408724
1959-09-30 23:59:59.999999999 -1.331987
1959-12-31 23:59:59.999999999 -0.830074
1960-03-31 23:59:59.999999999 -0.362657
...                                 ...
2008-09-30 23:59:59.999999999  0.120757
2008-12-31 23:59:59.999999999 -0.507626
2009-03-31 23:59:59.999999999 -0.153116
2009-06-30 23:59:59.999999999  0.975424
2009-09-30 23:59:59.999999999  1.523649

[203 rows x 6 columns]

## 8.3.3 将‘宽’转换为‘长’

In [94]:
df = pd.DataFrame({
    'key': 'foo bar baz'.split(),
    'A': [1, 2, 3],
    'B': [4,5,6],
    'C': [7,8,9]
})

In [95]:
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [101]:
melted = df.melt('key')

In [98]:
pd.melt?

In [100]:
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [102]:
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

In [103]:
reshaped = melted.pivot('key', 'variable')

In [104]:
reshaped

         value
variable     A  B  C
key
bar          2  5  8
baz          3  6  9
foo          1  4  7

In [105]:
melted.pivot?

In [106]:
reshaped.reset_index()

          key value
variable          A  B  C
0         bar     2  5  8
1         baz     3  6  9
2         foo     1  4  7

In [107]:
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [108]:
df.melt(id_vars='key', value_vars=['A','B'])

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6

In [109]:
df.melt(value_vars=['A','B','C'])

  variable  value
0        A      1
1        A      2
2        A      3
3        B      4
4        B      5
5        B      6
6        C      7
7        C      8
8        C      9

In [110]:
df.melt(value_vars=['key','A','B'])

  variable value
0      key   foo
1      key   bar
2      key   baz
3        A     1
4        A     2
5        A     3
6        B     4
7        B     5
8        B     6